NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32FG22/EFR32FG22C121F256GM40.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DCDC_NS</name>
      <version>0</version>
      <description>DCDC_NS Registers</description>
      <baseAddress>0x50094000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>IPVERSION</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>IPVERSION</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN</name>
          <description>Enable</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>Control</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000044</resetValue>
          <resetMask>0x00000077</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>DCDC/Bypass Mode Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASS</name>
                  <description>DCDC is OFF, bypass switch is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDCREGULATION</name>
                  <description>Request DCDC regulation, bypass switch disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMONLYEN</name>
              <description>DCDC DCM Only Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DUALMODE</name>
                  <description>Support higher load current at lower battery voltage by working in CCM mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMONLYEN</name>
                  <description>DCM only mode for normal operation, this is the default setting</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPKTMAXCTRL</name>
              <description>Peak Current Timeout Control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Ton_max disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMAX_0P35us</name>
                  <description>0.35us</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMAX_0P63us</name>
                  <description>0.63us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMAX_0P91us</name>
                  <description>0.91us</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMAX_1P19us</name>
                  <description>1.19us</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMAX_1P47us</name>
                  <description>1.47us</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMAX_1P75us</name>
                  <description>1.75us</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMAX_2P03us</name>
                  <description>2.03us</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EM01CTRL0</name>
          <description>EM01 Configurations</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000109</resetValue>
          <resetMask>0x0000030F</resetMask>
          <fields>
            <field>
              <name>IPKVAL</name>
              <description>EM01 Peak Current Setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Load36mA</name>
                  <description>Ipeak = 90mA, IL = 36mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Load40mA</name>
                  <description>Ipeak = 100mA, IL = 40mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Load44mA</name>
                  <description>Ipeak = 110mA, IL = 44mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Load48mA</name>
                  <description>Ipeak = 120mA, IL = 48mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Load52mA</name>
                  <description>Ipeak = 130mA, IL = 52mA</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Load56mA</name>
                  <description>Ipeak = 140mA, IL = 56mA</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Load60mA</name>
                  <description>Ipeak = 150mA, IL = 60mA</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRVSPEED</name>
              <description>EM01 Drive Speed Setting</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BEST_EMI</name>
                  <description>Lowest Efficiency, Lowest EMI.. Small decrease in efficiency from default setting</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT_SETTING</name>
                  <description>Default Efficiency, Acceptable EMI level</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERMEDIATE</name>
                  <description>Small increase in efficiency from the default setting</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEST_EFFICIENCY</name>
                  <description>Highest Efficiency, Highest EMI.. Small increase in efficiency from INTERMEDIATE setting</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EM23CTRL0</name>
          <description>EM23 Configurations</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000103</resetValue>
          <resetMask>0x0000030F</resetMask>
          <fields>
            <field>
              <name>IPKVAL</name>
              <description>EM23 Peak Current Setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOAD5MA</name>
                  <description>Ipeak = 90mA, IL = 5 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD10MA</name>
                  <description>Ipeak = 150mA, IL = 10 mA</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRVSPEED</name>
              <description>EM23 Drive Speed Setting</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BEST_EMI</name>
                  <description>Lowest Efficiency, Lowest EMI.. Small decrease in efficiency from default setting</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT_SETTING</name>
                  <description>Default Efficiency, Acceptable EMI level</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERMEDIATE</name>
                  <description>Small increase in efficiency from the default setting</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEST_EFFICIENCY</name>
                  <description>Highest Efficiency, Highest EMI.. Small increase in efficiency from INTERMEDIATE setting</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x024</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>BYPSW</name>
              <description>Bypass Switch Enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WARM</name>
              <description>DCDC Warmup Time Done</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RUNNING</name>
              <description>DCDC Running</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VREGINLOW</name>
              <description>VREGVDD below threshold</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VREGINHIGH</name>
              <description>VREGVDD above threshold</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGULATION</name>
              <description>DCDC in regulation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMAX</name>
              <description>Ton_max Timeout Reached</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM4ERR</name>
              <description>EM4 Entry Request Error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>Interrupt Enable</description>
          <addressOffset>0x028</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>BYPSW</name>
              <description>Bypass Switch Enabled Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WARM</name>
              <description>DCDC Warmup Time Done Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RUNNING</name>
              <description>DCDC Running Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VREGINLOW</name>
              <description>VREGVDD below threshold Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VREGINHIGH</name>
              <description>VREGVDD above threshold Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGULATION</name>
              <description>DCDC in Regulation Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMAX</name>
              <description>Ton_max Timeout Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM4ERR</name>
              <description>EM4 Entry Req Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>DCDC Status Register</description>
          <addressOffset>0x02C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>BYPSW</name>
              <description>Bypass Switch is currently enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WARM</name>
              <description>DCDC Warmup Done</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RUNNING</name>
              <description>DCDC is running</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VREGIN</name>
              <description>VREGVDD comparator status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BYPCMPOUT</name>
              <description>Bypass Comparator Output</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>No Description</description>
          <addressOffset>0x040</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>LOCKKEY</name>
              <description>Configuration Lock Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCKKEY</name>
                  <description>Value to write to unlock</description>
                  <value>43981</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKSTATUS</name>
          <description>No Description</description>
          <addressOffset>0x044</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Lock Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCKED</name>
                  <description>Unlocked State</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>LOCKED STATE</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
