NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32FG22/EFR32FG22C121F256GM40.svd
        <register>
          <name>SYNTHREGCTRL</name>
          <description>No Description</description>
          <addressOffset>0x098</addressOffset>
          <access>read-write</access>
          <resetValue>0x04000000</resetValue>
          <resetMask>0x07001C00</resetMask>
          <fields>
            <field>
              <name>MMDLDOVREFTRIM</name>
              <description>SYTRIMMMDREGVREF</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>vref0p6000</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6125</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6250</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6375</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6500</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6625</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6750</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6875</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHPLDOVREFTRIM</name>
              <description>SYTRIMCHPREGVREF</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>vref0p6000</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6125</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6250</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6375</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6500</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6625</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6750</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6875</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VCOCTRL</name>
          <description>No Description</description>
          <addressOffset>0x09C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000004C</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>VCOAMPLITUDE</name>
              <description>SYVCOAMPLOPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCODETAMPLITUDE</name>
              <description>SYVCOAMPLPKD</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNTHCTRL</name>
          <description>No Description</description>
          <addressOffset>0x0A4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000400</resetMask>
          <fields>
            <field>
              <name>MMDPOWERBALANCEDISABLE</name>
              <description>SYMMDPOWERBALANCEENB</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EnablePowerbleed</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DisablePowerBleed</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS2</name>
          <description>No Description</description>
          <addressOffset>0x0AC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>PREVSTATE1</name>
              <description>Previous Radio State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Radio is off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXWARM</name>
                  <description>Radio is enabling receiver</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXSEARCH</name>
                  <description>Radio is listening for incoming frames</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFRAME</name>
                  <description>Radio is receiving a frame</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXPD</name>
                  <description>Radio is powering down receiver and going to OFF state</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX2RX</name>
                  <description>Radio remains in receive mode after frame reception is completed</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXOVERFLOW</name>
                  <description>Received data was lost due to full receive buffer</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX2TX</name>
                  <description>Radio is disabling receiver and enabling transmitter</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXWARM</name>
                  <description>Radio is enabling transmitter</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX</name>
                  <description>Radio is transmitting data</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXPD</name>
                  <description>Radio is powering down transmitter and going to OFF state</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX2RX</name>
                  <description>Radio is disabling transmitter and enabling reception</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX2TX</name>
                  <description>Radio is preparing for a transmission after the previous transmission was ended</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHUTDOWN</name>
                  <description>Radio is powering down receiver and going to OFF state</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR</name>
                  <description>Radio power-on-reset state</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREVSTATE2</name>
              <description>Previous Radio State 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Radio is off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXWARM</name>
                  <description>Radio is enabling receiver</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXSEARCH</name>
                  <description>Radio is listening for incoming frames</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFRAME</name>
                  <description>Radio is receiving a frame</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXPD</name>
                  <description>Radio is powering down receiver and going to OFF state</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX2RX</name>
                  <description>Radio remains in receive mode after frame reception is completed</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXOVERFLOW</name>
                  <description>Received data was lost due to full receive buffer</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX2TX</name>
                  <description>Radio is disabling receiver and enabling transmitter</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXWARM</name>
                  <description>Radio is enabling transmitter</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX</name>
                  <description>Radio is transmitting data</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXPD</name>
                  <description>Radio is powering down transmitter and going to OFF state</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX2RX</name>
                  <description>Radio is disabling transmitter and enabling reception</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX2TX</name>
                  <description>Radio is preparing for a transmission after the previous transmission was ended</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHUTDOWN</name>
                  <description>Radio is powering down receiver and going to OFF state</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR</name>
                  <description>Radio power-on-reset state</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREVSTATE3</name>
              <description>Previous Radio State 3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Radio is off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXWARM</name>
                  <description>Radio is enabling receiver</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXSEARCH</name>
                  <description>Radio is listening for incoming frames</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFRAME</name>
                  <description>Radio is receiving a frame</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXPD</name>
                  <description>Radio is powering down receiver and going to OFF state</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX2RX</name>
                  <description>Radio remains in receive mode after frame reception is completed</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXOVERFLOW</name>
                  <description>Received data was lost due to full receive buffer</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX2TX</name>
                  <description>Radio is disabling receiver and enabling transmitter</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXWARM</name>
                  <description>Radio is enabling transmitter</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX</name>
                  <description>Radio is transmitting data</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXPD</name>
                  <description>Radio is powering down transmitter and going to OFF state</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX2RX</name>
                  <description>Radio is disabling transmitter and enabling reception</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX2TX</name>
                  <description>Radio is preparing for a transmission after the previous transmission was ended</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHUTDOWN</name>
                  <description>Radio is powering down receiver and going to OFF state</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR</name>
                  <description>Radio power-on-reset state</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRSTATE</name>
              <description>Current Radio State</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Radio is off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXWARM</name>
                  <description>Radio is enabling receiver</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXSEARCH</name>
                  <description>Radio is listening for incoming frames</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFRAME</name>
                  <description>Radio is receiving a frame</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXPD</name>
                  <description>Radio is powering down receiver and going to OFF state</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX2RX</name>
                  <description>Radio remains in receive mode after frame reception is completed</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXOVERFLOW</name>
                  <description>Received data was lost due to full receive buffer</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX2TX</name>
                  <description>Radio is disabling receiver and enabling transmitter</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXWARM</name>
                  <description>Radio is enabling transmitter</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX</name>
                  <description>Radio is transmitting data</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXPD</name>
                  <description>Radio is powering down transmitter and going to OFF state</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX2RX</name>
                  <description>Radio is disabling transmitter and enabling reception</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX2TX</name>
                  <description>Radio is preparing for a transmission after the previous transmission was ended</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHUTDOWN</name>
                  <description>Radio is powering down receiver and going to OFF state</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR</name>
                  <description>Radio power-on-reset state</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
